---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionAccessor.GetId
source: html/6df7bac4-6e17-a56f-138a-e225c3d2e4dd.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor.GetId Method

Retrieves the unique identifier of the FailureDefinition.

## Syntax (C#)
```csharp
public FailureDefinitionId GetId()
```

## Returns
The unique identifier of the FailureDefinition.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The FailureDefinitionAccessor has not been properly initialized.